app/views/products/index.html.erb

SELECT "products".* FROM "products"
---
<script type="text/javascript" charset="utf-8">
$(function() {
  $(".js-more").on("click", function() {
    var id = $(this).data("id");
    $.get("/products/" + id + ".json", function(data) {
      var inventoryText = "<strong>Available</strong>";
      if(data.inventory === "false"){
        inventoryText = "<strong>Sold Out</strong>";
      }
      list = "<ul>"
      data.ordered_products.forEach((i)=>{
        list = list + `<li>${i.order_id}   ${i.created_at}</li>`
      })
      var descriptionText = "<p>" + data.description + "</p><p>" + inventoryText + "</p>" + list + '</ul>';
      $("#product-" + id).text(descriptionText);
    });
  });
});